; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	image3 - mode
	infrared4 - mode
	image2 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation5 - direction
	Star4 - direction
	Star2 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared4)
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 image2)
	(supports instrument1 image3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 Star11)
	(have_image Phenomenon6 image1)
	(have_image Phenomenon7 infrared4)
	(have_image Star8 infrared4)
	(have_image Star9 image2)
	(have_image Star10 image3)
	(have_image Star11 image0)
))

)

; plan
1. (turn_to satellite1 groundstation5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon6 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon6)
   goals met: 0 of 8
5. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 1 of 8
6. (take_image satellite1 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 2 of 8
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
8. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 8
9. (turn_to satellite0 phenomenon7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 8
10. (take_image satellite0 phenomenon7 instrument0 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 2 of 8
11. (turn_to satellite0 star10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star10)
   goals met: 2 of 8
12. (take_image satellite0 star10 instrument0 image3)
   added: (have_image star10 image3)
   goals met: 3 of 8
13. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 3 of 8
14. (take_image satellite0 star11 instrument0 image0)
   added: (have_image star11 image0)
   goals met: 4 of 8
15. (turn_to satellite0 star8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star8)
   goals met: 4 of 8
16. (take_image satellite0 star8 instrument0 infrared4)
   added: (have_image star8 infrared4)
   goals met: 5 of 8
17. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 6 of 8
18. (turn_to satellite1 star9 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star9)
   goals met: 6 of 8
19. (take_image satellite1 star9 instrument1 image2)
   added: (have_image star9 image2)
   goals met: 7 of 8
20. (turn_to satellite1 star11 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star11)
   goals met: 8 of 8
